// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаКешаRedisПриЗаписи(Источник, Отказ) Экспорт
	// Добавьте свои объекты в состав подписки и очищайте \ обновляйте кеш при записи объекта.
	// ВНИМАНИЕ! 
	// REDIS не обеспечивает транзакционную целостность при отмене транзакции, поэтому рекомендуется очищать кеш, а не перезаполнять его.
КонецПроцедуры

#КонецОбласти


//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
